&НаСервереБезКонтекста
Функция ПредопределенныйУзел(Узел)
	
	Возврат Узел = ПланыОбмена.Мобильные.ЭтотУзел();
	
КонецФункции

&НаКлиенте
Процедура ЗарегестрироватьИзменения(Команда)
	ЗарегестрироватьИзмененияНаСервере(УзелОбмена);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегестрироватьИзмененияНаСервере(Узел)
	ПланыОбмена.ЗарегистрироватьИзменения(Узел);
КонецПроцедуры


&НаКлиенте
Процедура УзелОбменаПриИзменении(Элемент)//
	
	Если ПредопределенныйУзел(УзелОбмена) Тогда
		Элементы.ВыгрузитьДанные.Доступность = Ложь;
		Элементы.ЗагрузитьДанные.Доступность = Ложь;
		Элементы.ФормаЗарегестрироватьИзменения.Доступность = Ложь;
	Иначе
		Элементы.ВыгрузитьДанные.Доступность = Истина;
		Элементы.ЗагрузитьДанные.Доступность = Истина;
		Элементы.ФормаЗарегестрироватьИзменения.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог информационной базы";
	Если Диалог.Выбрать() Тогда
		ЗагрузитьДанныеНаСервере(УзелОбмена,Диалог.Каталог);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьДанныеНаСервере(Узел, Каталог)
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.ПрочитатьСообщениеСИзминениями(Каталог);

КонецПроцедуры


&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Укажите каталог информационной базы";
	Если Диалог.Выбрать() Тогда
		ВыгрузитьДанныеНаСервере(УзелОбмена,Диалог.Каталог);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьДанныеНаСервере(Узел, Каталог)
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.ЗаписатьСообщениеСИзменениями(Каталог); //

КонецПроцедуры

